Revit 2026 API

# ScheduleDefinitionIsKeySchedule Property

---

Indicates if the schedule is a key schedule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsKeySchedule { get; }
```
```vb
Public ReadOnly Property IsKeySchedule As Boolean
	Get
```
```cpp
public:
property bool IsKeySchedule {
	bool get ();
}
```
```fsharp
member IsKeySchedule : bool with get
```

#### Property Value

Boolean

A key schedule displays abstract "key" elements that can be used to populate parameters of ordinary model elements.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace